Revit 2027 API
IndexStreamLine Class
 A stream that can be used to write IndexLine primitives into an IndexBuffer
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.IndexStream
 Autodesk.Revit.DB.DirectContext3D.IndexStreamLine
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class IndexStreamLine : IndexStream
Public Class IndexStreamLine
	Inherits IndexStream
public ref class IndexStreamLine : public IndexStream
type IndexStreamLine =
    class
        inherit IndexStream
    end
The IndexStreamLine type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from IndexStream)
Top
Methods
Name | Description
AddLine |  Inserts a IndexLine segment into the stream and associated buffer.
AddLines |  Inserts multiple IndexLine segments into the stream and associated buffer.
Dispose
(Inherited from IndexStream)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.DirectContext3D Namespace